<template>
  <v-container>
    <h1 class="text-center">নূরুল কুরআন একাডেমি এর স্টাডিজ ইন ইসলামী শরীয়াহ প্রোগ্রামের এর পাঠ্যক্রম</h1>
    <p></p>
    <p
      class="text-body-1"
    >নূরুল কুরআন একাডেমি এর ‘স্টাডিজ ইন ইসলামী শরীয়াহ’ প্রোগ্রাম এর পাঠ্যক্রমটি মোট ৩টি লেভেলে বিভক্ত। পরের লেভেলে যাওয়ার জন্য অবশ্যই আগের লেভেলের পড়াগুলো সমাপ্ত করতে হবে। যে কোন লেভেল শেষ করে পড়া ক্ষান্ত দেওয়ার অবকাশও থাকবে। যেহেতু প্রতিটি লেভেলকে স্বয়ংসম্পূর্ণরূপে সাজানো হয়েছে।</p>
    <p></p>
    <span v-if="isMobile()">
      <h2>ব্যাসিক স্টাডিজ ইন ইসলামী শরীয়াহ</h2>
      <p></p>
      <p>ব্যাসিক লেভেল একেবারে ব্যাসিক বিষয়গুলো দিয়ে সাজানো হয়েছে। যাতে রয়েছে আরবীভাষা, ব্যাসিক আকিদা, নাহু-সরফের প্রাথমিক পাঠ ও ফিকহের প্রাথমিক পাঠ। এই লেভেল শেষ করার পর প্রাথমিকভাবে আরবী বোঝা সম্ভব হবে। কুরআনের অধিকাংশ অর্থ বোঝা সম্ভব হবে। আরবী বইপত্র মোটামুটি বোঝা সম্ভব হবে। ব্যাসিক লেভেল সমাপ্তকারীদের মধ্যে যারা আগ্রহী তারা ইন্টারমিডিয়েট লেভেল শুরু করবেন। যে কেউ চাইলে ব্যাসিক লেভেল শেষ করেই পড়া সমাপ্ত করতে পারবেন। যেহেতু এটি শেষ করার মাধ্যমে একটা পর্যায়ে আসা হয়েছে।</p>
      <h2>ইন্টারমিডিয়েট স্টাডিজ ইন ইসলামী শরীয়াহ</h2>
      <p></p>
      <p>ইন্টারমিডিয়েট লেভেলে মূলত আরবী ভাষাজ্ঞানকে আরো পাকাপোক্ত করার প্রতি জোর দেওয়া হবে। তাই আরবী ব্যকরণের নাহু-সরফকে আরো বিস্তারিত আকারে পড়ানো হবে। সেইসাথে আরবীসাহিত্য, কুরআনের অনুবাদ, বালাগাত বা আরবী অলঙ্কারশাস্ত্র ইত্যাদিও থাকবে। যেন ইন্টারমিডিয়েট লেভেলের আরবী কিতাবগুলো পড়া ও আরবী কিতাবাদি থেকে দ্বীনের ইলম নেবার যোগ্যতা অর্জিত হয়।</p>
      <h2>এডভান্স স্টাডিজ ইন ইসলামী শরীয়াহ</h2>
      <p></p>
      <p>এডভান্স লেভেল থেকে সকল সাবজেক্ট সরাসরি আরবী কিতাবাদি থেকেই পড়ানো হবে। এতে শরঈ ইলমের গুরুত্বপূর্ণ বিষয়গুলো (ফিকহ, উসুলুল ফিকহ, হাদীস, উসুলুল হাদীস, উলুমুল কুরআন ও উসুলুত তাফসীর ইত্যাদি) সম্পর্কে ধারণালাভ করবে একজন শিক্ষার্থী। সর্বশেষ আলফিয়াতুল হাদীস বা ‘হাজার-হাদীস’ নামক কিতাব পড়ার মাধ্যমে তার এই দীর্ঘ সিলেবাস সম্পন্ন হবে। এতে হাদীসের কিতাবসমূহের প্রায় সকল অধ্যায়ের হাদীস উল্লেখিত হয়েছে।</p>
    </span>
    <v-grid v-else>
      <v-row>
        <v-col>
          <v-card color="#cfe2f3"  class="mx-auto">
            <v-card-title>ব্যাসিক স্টাডিজ ইন ইসলামী শরীয়াহ</v-card-title>
            <v-card-text>
              <p>ব্যাসিক লেভেল একেবারে ব্যাসিক বিষয়গুলো দিয়ে সাজানো হয়েছে। যাতে রয়েছে আরবীভাষা, ব্যাসিক আকিদা, নাহু-সরফের প্রাথমিক পাঠ ও ফিকহের প্রাথমিক পাঠ। এই লেভেল শেষ করার পর প্রাথমিকভাবে আরবী বোঝা সম্ভব হবে। কুরআনের অধিকাংশ অর্থ বোঝা সম্ভব হবে। আরবী বইপত্র মোটামুটি বোঝা সম্ভব হবে। ব্যাসিক লেভেল সমাপ্তকারীদের মধ্যে যারা আগ্রহী তারা ইন্টারমিডিয়েট লেভেল শুরু করবেন। যে কেউ চাইলে ব্যাসিক লেভেল শেষ করেই পড়া সমাপ্ত করতে পারবেন। যেহেতু এটি শেষ করার মাধ্যমে একটা পর্যায়ে আসা হয়েছে।</p>
            </v-card-text>
          </v-card>
        </v-col>
        <v-col>
          <v-card color="#d9ead3" class="mx-auto">
            <v-card-title>ইন্টারমিডিয়েট স্টাডিজ ইন ইসলামী শরীয়াহ</v-card-title>
            <v-card-text>
              <p>ইন্টারমিডিয়েট লেভেলে মূলত আরবী ভাষাজ্ঞানকে আরো পাকাপোক্ত করার প্রতি জোর দেওয়া হবে। তাই আরবী ব্যকরণের নাহু-সরফকে আরো বিস্তারিত আকারে পড়ানো হবে। সেইসাথে আরবীসাহিত্য, কুরআনের অনুবাদ, বালাগাত বা আরবী অলঙ্কারশাস্ত্র ইত্যাদিও থাকবে। যেন ইন্টারমিডিয়েট লেভেলের আরবী কিতাবগুলো পড়া ও আরবী কিতাবাদি থেকে দ্বীনের ইলম নেবার যোগ্যতা অর্জিত হয়।</p>
            </v-card-text>
          </v-card>
        </v-col>
        <v-col>
          <v-card color="#ead1dc" class="mx-auto">
            <v-card-title>এডভান্স স্টাডিজ ইন ইসলামী শরীয়াহ</v-card-title>
            <v-card-text>
              <p>এডভান্স লেভেল থেকে সকল সাবজেক্ট সরাসরি আরবী কিতাবাদি থেকেই পড়ানো হবে। এতে শরঈ ইলমের গুরুত্বপূর্ণ বিষয়গুলো (ফিকহ, উসুলুল ফিকহ, হাদীস, উসুলুল হাদীস, উলুমুল কুরআন ও উসুলুত তাফসীর ইত্যাদি) সম্পর্কে ধারণালাভ করবে একজন শিক্ষার্থী। সর্বশেষ আলফিয়াতুল হাদীস বা ‘হাজার-হাদীস’ নামক কিতাব পড়ার মাধ্যমে তার এই দীর্ঘ সিলেবাস সম্পন্ন হবে। এতে হাদীসের কিতাবসমূহের প্রায় সকল অধ্যায়ের হাদীস উল্লেখিত হয়েছে।</p>
            </v-card-text>
          </v-card>
        </v-col>
      </v-row>
    </v-grid>

    <h2
      class="blue darken-2 text-center white--text"
      v-if="isMobile()"
      style="margin:20px 0px 20px 0px;"
    >ব্যাসিক স্টাডিজ ইন ইসলামী শরীয়াহ</h2>
    <h2 class="blue darken-2 text-center white--text" style="margin-top:20px;" v-else>ব্যাসিক স্টাডিজ ইন ইসলামী শরীয়াহ</h2>
    <Year year="১ম বর্ষ" v-bind:syllabus="first_year" bgcolor="#cfe2f3" />
    <Year year="২য় বর্ষ" v-bind:syllabus="second_year" bgcolor="#9fc5e8" />
    <h2
      class="green darken-2 text-center white--text"
      v-if="isMobile()"
      style="margin:20px 0px 20px 0px"
    >ইন্টারমিডিয়েট স্টাডিজ ইন ইসলামী শরীয়াহ</h2>
    <h2 class="green darken-2 text-center white--text" v-else>ইন্টারমিডিয়েট স্টাডিজ ইন ইসলামী শরীয়াহ</h2>
    <Year year="৩য় বর্ষ" v-bind:syllabus="third_year" bgcolor="#d9ead3" />
    <h2
      class="red darken-2 text-center white--text"
      v-if="isMobile()"
      style="margin:20px 0px 20px 0px"
    >এডভান্স স্টাডিজ ইন ইসলামী শরীয়াহ</h2>
    <h2 class="red darken-2 text-center white--text" v-else>এডভান্স স্টাডিজ ইন ইসলামী শরীয়াহ</h2>
    <Year year="৪র্থ বর্ষ" v-bind:syllabus="fourth_year" bgcolor="#ead1dc" />
    <Year year="৫ম বর্ষ" v-bind:syllabus="fifth_year" bgcolor="#f4cccc" />
  </v-container>
</template>

<script>
const first_year = [
  {
    title: "১ম সেমিস্টার (৪ মাস)",
    body: ["এসো আরবি শিখি (১ম খণ্ড)", "আদব-আখলাক"]
  },
  {
    title: "২য় সেমিস্টার (৪ মাস)",
    body: [
      "এসো আরবি শিখি (২য় খণ্ড, ১ম অধ্যায় অর্ধেক; ১-৯ পাঠ)",
      "ব্যাসিক আকিদা"
    ]
  },
  {
    title: "৩য় সেমিস্টার (৪ মাস)",
    body: [
      "এসো আরবি শিখি (২য় খণ্ড, ১ম অধ্যায় শেষ পর্যন্ত; ১০-২১ পাঠ)",
      "ফিকহের পরিচয় (ফিকহের উদ্ভব, ক্রমবিকাশ, ফিকহে হানাফির পরিচয়, ইতিহাস ও বৈশিষ্ট্য ইত্যাদি)",
      "নাহুর প্রাথমিক পাঠ-১ (‘মাবাদিউন নাহু’ কিতাব)"
    ]
  }
];

const second_year = [
  {
    title: "১ম সেমিস্টার (৪ মাস)",
    body: [
      "এসো আরবি শিখি (২য় খণ্ড, ২য়-৩য় অধ্যায়)",
      "ফিকহ (তাহারাত বা পাক-নাপাক, ওজু-গোসল-তায়াম্মুম)",
      "নাহুর প্রাথমিক পাঠ-২ (‘মাবাদিউন নাহু’ কিতাব)"
    ]
  },
  {
    title: "২য় সেমিস্টার (৪ মাস)",
    body: ["এসো আরবি শিখি (৩য় খণ্ড, ১ম অধ্যায়)", "ফিকহ (সালাত বিষয়ক মাসায়েল)"]
  },
  {
    title: "৩য় সেমিস্টার (৪ মাস)",
    body: [
      "এসো আরবি শিখি (৩য় খণ্ড, ২য়-৩য় অধ্যায়)",
      "ফিকহ (সালাত ও বিবাহ-তালাক বিষয়ক মাসায়েল)"
    ]
  }
];

const third_year = [
  {
    title: "১ম সেমিস্টার (৪ মাস)",
    body: [
      "আরবীসাহিত্য (‘ক্বাসাসুন নাবিয়্যিন’ ১ম খণ্ড)",
      "সরফ (‘মাবাদিউস সরফ’ কিতাব)",
      "নাহু (‘হিদায়াতুন নাহু’ কিতাব)"
    ]
  },
  {
    title: "২য় সেমিস্টার (৪ মাস)",
    body: [
      "এডভান্স সরফ (‘আল-হাদী ইলাস সরফ’ কিতাব)",
      "নাহু (‘হিদায়াতুন নাহু’ কিতাব)",
      " তরজমাতুল কুরআন ও সংক্ষিপ্ত তাফসীর (সুরা বাকারা, ১ম পারা, ও ২য় পারার অর্ধেক)"
    ]
  },
  {
    title: "৩য় সেমিস্টার (৪ মাস)",
    body: [
      "নাহু (‘হিদায়াতুন নাহু’ কিতাব)",
      "বালাগাত বা অলঙ্কার শাস্ত্র (‘দুরুসুল বালাগাহ’ কিতাব)",
      "তরজমাতুল কুরআন ও সংক্ষিপ্ত তাফসীর (সুরা বাকারা শেষ পর্যন্ত)"
    ]
  }
];

const fourth_year = [
  {
    title: "১ম সেমিস্টার (৪ মাস)",
    body: [
      "ফিকহ (‘নূরুল ইযাহ’ থেকে সওম অধ্যায়)",
      "আরবীসাহিত্য (আল-কিরাআতুর রাশিদা ১ম খণ্ড)",
      "সীরাত (একাডেমির শিট)"
    ]
  },
  {
    title: "২য় সেমিস্টার (৪ মাস)",
    body: [
      "ফিকহ (‘নূরুল ইযাহ’ থেকে যাকাত অধ্যায়)",
      "উসুলুল ফিকহ (‘তাইসীরুল উসুল’ কিতাব)",
      "ইমাম নববির ‘আল-আরবাঈন’ বা ৪০ হাদীস"
    ]
  },
  {
    title: "৩য় সেমিস্টার (৪ মাস)",
    body: [
      "ফিকহ (‘নূরুল ইযাহ’ থেকে হজ অধ্যায়) ",
      "উসুলুল ফিকহ (‘তাইসীরুল উসুল’ কিতাব)",
      "আকীদা তাহাবি-১"
    ]
  }
];

const fifth_year = [
  {
    title: "১ম সেমিস্টার (৪ মাস)",
    body: [
      "ফিকহ (‘মুখতাসারুল কুদুরি’ কিতাব থেকে কিতাবুল বুয়ু বা লেনদেন অধ্যায়)",
      "উসুলুত তাফসীর (‘আল-ফাওযুল কাবীর’ কিতাব)",
      "আকীদা তাহাবি-২"
    ]
  },
  {
    title: "২য় সেমিস্টার (৪ মাস)",
    body: [
      "ফিকহ (‘মুখতাসারুল কুদুরি’ কিতাব থেকে কিতাবুল বুয়ু বা লেনদেন অধ্যায় ও আনুষাঙ্গিক)",
      "উসুলুল হাদিস ও মুস্তালাহুল হাদিস (‘তাইসিরু মুস্তালাহিল হাদিস’ কিতাব)",
      "উলুমুল কুরআন (‘মাবাদিউ উলুমিল কুরআন’ কিতাব)"
    ]
  },
  {
    title: "৩য় সেমিস্টার (৪ মাস)",
    body: [
      "হাদীসুর রাসূল সা. [১ হাজার হাদীস] (‘আলফিয়াতুল হাদীস’ কিতাব)",
      "হাদীস সঙ্কলনের ইতিহাস, হাদীসের ইমামগণ ও তাদের কিতাব পরিচিতি"
    ]
  }
];

import Year from "@/components/syllabus/Year.vue";

export default {
  components: {
    Year
  },
  data() {
    return {
      first_year,
      second_year,
      third_year,
      fourth_year,
      fifth_year
    };
  },
  methods: {
    isMobile() {
      if (
        /Android|webOS|iPhone|iPad|iPod|BlackBerry|IEMobile|Opera Mini/i.test(
          navigator.userAgent
        )
      ) {
        return true;
      } else {
        return false;
      }
    }
  }
};
</script>>